# SetMemberForces Method (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalModelStick..::..SetMemberForces Method
AnalyticalModelStick Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetMemberForces(MemberForces) | Sets Member Forces to element. |
| SetMemberForces(Boolean, XYZ, XYZ) | Adds Member Forces to element. |

# See Also
AnalyticalModelStick Class
AnalyticalModelStick Members
Autodesk.Revit.DB.Structure Namespace